jankaluza/qsimkit/QSimKit/MCU/MSP430/CPU/Variants/msp430x24x.cpp
		unsigned int getUCA1BR0() {
#ifdef UCA1BR0_
			return UCA1BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1BR1() {
#ifdef UCA1BR1_
			return UCA1BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1MCTL() {
#ifdef UCA1MCTL_
			return UCA1MCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1STAT() {
#ifdef UCA1STAT_
			return UCA1STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1RXBUF() {
#ifdef UCA1RXBUF_
			return UCA1RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1TXBUF() {
#ifdef UCA1TXBUF_
			return UCA1TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1ABCTL() {
#ifdef UCA1ABCTL_
			return UCA1ABCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1IRTCTL() {
#ifdef UCA1IRTCTL_
			return UCA1IRTCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCA1IRRCTL() {
#ifdef UCA1IRRCTL_
			return UCA1IRRCTL_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1CTL0() {
#ifdef UCB1CTL0_
			return UCB1CTL0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1CTL1() {
#ifdef UCB1CTL1_
			return UCB1CTL1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1BR0() {
#ifdef UCB1BR0_
			return UCB1BR0_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1BR1() {
#ifdef UCB1BR1_
			return UCB1BR1_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2CIE() {
#ifdef UCB1I2CIE_
			return UCB1I2CIE_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1STAT() {
#ifdef UCB1STAT_
			return UCB1STAT_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1RXBUF() {
#ifdef UCB1RXBUF_
			return UCB1RXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1TXBUF() {
#ifdef UCB1TXBUF_
			return UCB1TXBUF_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2COA() {
#ifdef UCB1I2COA_
			return UCB1I2COA_;
#else
			return 0;
#endif
		}


		unsigned int getUCB1I2CSA() {
#ifdef UCB1I2CSA_
			return UCB1I2CSA_;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB1TX_VECTOR() {
#ifdef USCIAB1TX_VECTOR
			return USCIAB1TX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUSCIAB1RX_VECTOR() {
#ifdef USCIAB1RX_VECTOR
			return USCIAB1RX_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getUC1IE() {
#ifdef UC1IE_
			return UC1IE_;
#else
			return 0;
#endif
		}


		unsigned int getUC1IFG() {
#ifdef UC1IFG_
			return UC1IFG_;
#else
			return 0;
#endif
		}


		double getSRSEL() {
#ifdef SRSEL
			return SRSEL;
#else
			return 0;
#endif
		}


		double getSDCO() {
#ifdef SDCO
			return SDCO;
#else
			return 0;
#endif
		}


		double getDCOZERO() {
#ifdef DCOZERO
			return DCOZERO;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430x24x", msp430x24x);

